Autodesk.Revit.DB.VisibleInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Constructs a new instance of a VisibleInViewFilter, with the option to pass all non-visible elements.
document:
The document that owns the view.
viewId:
The view id.
inverted:
True if the filter should match all elements not visible in the given view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.VisibleInViewFilter.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of a VisibleInViewFilter.
document:
The document that owns the view.
viewId:
The view id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
viewId is not a view.
-or-
viewId is not valid for element iteration, because it has no way of representing drawn elements.  Many view templates
will fail this check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021